[
  {
    "id": 2,
    "title": "Construction Superintendent",
    "department": "Field Operations",
    "location": "Miami, FL",
    "type": "full-time",
    "description": "ARCEMUSA is looking for a skilled Construction Superintendent to oversee day-to-day field operations on our residential and commercial construction sites. You will be responsible for coordinating subcontractors, ensuring safety compliance, and maintaining quality control standards.",
    "requirements": "Minimum 5 years of experience as a Construction Superintendent\nStrong knowledge of construction methods, materials, and building codes\nOSHA 30-hour certification\nExperience with scheduling and coordinating subcontractors\nAbility to read and interpret construction plans and specifications\nExcellent problem-solving and communication skills\nValid driver's license and reliable transportation",
    "responsibilities": "Supervise and coordinate all on-site construction activities\nEnsure projects adhere to schedules, specifications, and budgets\nImplement and enforce safety protocols and quality control measures\nCoordinate material deliveries and manage on-site inventory\nConduct daily subcontractor meetings to review progress and resolve issues\nMaintain detailed daily logs and progress reports\nCollaborate with Project Managers to address any site challenges\nInspect work for compliance with building codes and project specifications",
    "benefits": "Competitive salary based on experience\nComprehensive health and dental insurance\n401(k) retirement plan\nPaid time off and holidays\nCompany truck and fuel allowance\nCell phone allowance\nOpportunities for advancement",
    "salary": "$75,000 - $95,000 per year, based on experience",
    "applyUrl": null,
    "active": true,
    "featured": true,
    "createdAt": "2025-03-13T03:34:40.386Z",
    "updatedAt": null
  },
  {
    "id": 3,
    "title": "Civil Engineer",
    "department": "Engineering",
    "location": "Denver, CO",
    "type": "full-time",
    "description": "Join our engineering team as a Civil Engineer responsible for designing and developing infrastructure for our commercial and industrial construction projects. You will work closely with project teams to provide technical expertise and innovative solutions.",
    "requirements": "Bachelor's degree in Civil Engineering (Master's preferred)\nProfessional Engineer (PE) license\n3+ years of experience in civil engineering for construction projects\nProficiency in AutoCAD, Civil 3D, and other relevant software\nKnowledge of local building codes and regulations\nStrong analytical and problem-solving skills\nExcellent written and verbal communication abilities",
    "responsibilities": "Develop civil engineering designs for construction projects\nCreate site development plans, including grading, drainage, and utilities\nPerform engineering calculations and prepare technical specifications\nReview and approve shop drawings and submittals\nCoordinate with architects, contractors, and regulatory agencies\nConduct site visits to monitor construction progress\nEnsure compliance with applicable codes and regulations\nPrepare permit applications and supporting documentation",
    "benefits": "Competitive salary and performance bonuses\nHealth, dental, and vision insurance\n401(k) retirement plan with company match\nProfessional development and license renewal support\nPaid time off and holidays\nFlexible work arrangements\nCollaborative team environment",
    "salary": "$70,000 - $90,000 per year, depending on qualifications",
    "applyUrl": null,
    "active": true,
    "featured": false,
    "createdAt": "2025-03-13T03:34:40.386Z",
    "updatedAt": null
  },
  {
    "id": 4,
    "title": "Estimator",
    "department": "Preconstruction",
    "location": "Atlanta, GA",
    "type": "full-time",
    "description": "We are seeking a detail-oriented Estimator to join our preconstruction team. In this role, you will be responsible for developing accurate cost estimates for construction projects, analyzing drawings and specifications, and supporting the bid process.",
    "requirements": "Bachelor's degree in Construction Management, Engineering, or related field\n3+ years of experience in construction estimating\nProficiency in estimating software and MS Excel\nStrong understanding of construction methods and materials\nAbility to read and interpret construction documents\nExcellent analytical and mathematical skills\nAttention to detail and accuracy\nStrong communication and negotiation abilities",
    "responsibilities": "Prepare detailed cost estimates for construction projects\nReview plans, specifications, and contract documents\nSolicit and analyze subcontractor and supplier quotes\nIdentify cost-saving opportunities and value engineering solutions\nParticipate in pre-bid meetings and site visits\nAssist in developing project budgets and schedules\nSupport the bid preparation and submission process\nMaintain current knowledge of material costs and market trends",
    "benefits": "Competitive salary\nComprehensive benefits package\n401(k) retirement plan\nProfessional development opportunities\nPaid time off\nCollaborative work environment",
    "salary": "$65,000 - $85,000 per year, commensurate with experience",
    "applyUrl": null,
    "active": true,
    "featured": false,
    "createdAt": "2025-03-13T03:34:40.386Z",
    "updatedAt": null
  },
  {
    "id": 5,
    "title": "Safety Manager",
    "department": "Safety & Compliance",
    "location": "Chicago, IL",
    "type": "full-time",
    "description": "ARCEMUSA is seeking a Safety Manager to develop, implement, and oversee our company-wide safety program across all project sites. The ideal candidate will have a strong background in construction safety and a passion for creating a culture of safety excellence.",
    "requirements": "Bachelor's degree in Safety Management, Construction Management, or related field\nOSHA 30-hour certification (CHST or CSP preferred)\n5+ years of experience in construction safety management\nKnowledge of federal, state, and local safety regulations\nStrong leadership and communication skills\nExperience with safety training and program development\nProficiency with safety management software\nValid driver's license and ability to travel to multiple project sites",
    "responsibilities": "Develop and maintain company safety policies and procedures\nConduct regular safety inspections and audits of project sites\nInvestigate incidents and near-misses and implement corrective actions\nProvide safety training for employees and subcontractors\nEnsure compliance with OSHA and other regulatory requirements\nTrack and report safety metrics and performance indicators\nCollaborate with project teams to address safety concerns\nStay current with industry best practices and regulations",
    "benefits": "Competitive salary\nComprehensive health benefits\n401(k) retirement plan with company match\nProfessional development and certification support\nCompany vehicle or allowance\nPaid time off and holidays",
    "salary": "$75,000 - $95,000 annually, based on experience and certifications",
    "applyUrl": null,
    "active": true,
    "featured": false,
    "createdAt": "2025-03-13T03:34:40.386Z",
    "updatedAt": null
  },
  {
    "id": 6,
    "title": "Project Engineer",
    "department": "Project Management",
    "location": "Miami, FL",
    "type": "full-time",
    "description": "We are looking for a Project Engineer to support our project management team on commercial construction projects. This position is ideal for candidates who are early in their construction career and eager to learn and grow with our company.",
    "requirements": "Bachelor's degree in Construction Management, Engineering, or related field\n0-3 years of experience in construction (internship experience considered)\nFamiliarity with construction documents and procedures\nProficiency in MS Office Suite\nBasic knowledge of construction methods and materials\nStrong organizational and communication skills\nAbility to work in a fast-paced team environment\nWillingness to learn and take on new responsibilities",
    "responsibilities": "Assist Project Managers with daily project activities\nReview and process submittals, RFIs, and change orders\nMaintain project documentation and filing systems\nPrepare meeting minutes and track action items\nCoordinate with subcontractors and suppliers\nPerform quantity takeoffs and material tracking\nAssist with quality control inspections\nSupport schedule updates and progress tracking",
    "benefits": "Competitive entry-level salary\nHealth, dental, and vision insurance\n401(k) retirement plan\nPaid time off\nMentorship opportunities\nProfessional development and training\nClear career advancement path",
    "salary": "$55,000 - $70,000 per year",
    "applyUrl": null,
    "active": true,
    "featured": false,
    "createdAt": "2025-03-13T03:34:40.386Z",
    "updatedAt": null
  },
  {
    "id": 7,
    "title": "Administrative Assistant",
    "department": "Administration",
    "location": "Denver, CO",
    "type": "full-time",
    "description": "ARCEMUSA is seeking an Administrative Assistant to provide support to our office operations. The ideal candidate will be organized, detail-oriented, and possess excellent communication skills to help maintain efficient office functions.",
    "requirements": "High school diploma required, Associate's degree preferred\n2+ years of administrative or office experience\nProficiency in MS Office Suite (Word, Excel, Outlook)\nStrong organizational and time management skills\nExcellent written and verbal communication abilities\nProfessional demeanor and customer service orientation\nAbility to handle confidential information with discretion\nExperience in construction industry a plus",
    "responsibilities": "Provide administrative support to executives and project teams\nManage phone calls, correspondence, and office communication\nCoordinate meetings, travel arrangements, and office events\nMaintain filing systems and organize office documentation\nProcess expense reports and invoices\nAssist with basic accounting and data entry tasks\nOrder office supplies and manage inventory\nGreet visitors and provide a professional front office presence",
    "benefits": "Competitive hourly wage\nHealth benefits package\nPaid time off and holidays\n401(k) retirement plan\nProfessional work environment\nOpportunity for growth and skill development",
    "salary": "$40,000 - $50,000 per year",
    "applyUrl": null,
    "active": true,
    "featured": false,
    "createdAt": "2025-03-13T03:34:40.386Z",
    "updatedAt": null
  },
  {
    "id": 8,
    "title": "Marketing Coordinator",
    "department": "Marketing",
    "location": "Atlanta, GA",
    "type": "part-time",
    "description": "We are looking for a part-time Marketing Coordinator to support our marketing and business development efforts. This role will assist with creating marketing materials, maintaining our online presence, and supporting proposal development.",
    "requirements": "Bachelor's degree in Marketing, Communications, or related field\n1-3 years of marketing experience, preferably in AEC industry\nProficiency in graphic design software (Adobe Creative Suite)\nExperience with website management and social media platforms\nStrong writing and editing skills\nKnowledge of digital marketing strategies\nAttention to detail and creative problem-solving abilities\nPhotography skills a plus",
    "responsibilities": "Assist with the creation of marketing materials and presentations\nUpdate company website and social media platforms\nSupport the development of project proposals and qualifications packages\nCoordinate photography for completed projects\nMaintain marketing database and project information\nAssist with industry events and client relationship activities\nTrack marketing metrics and reporting\nSupport public relations and community outreach initiatives",
    "benefits": "Competitive hourly rate\nFlexible work schedule (20-25 hours per week)\nPaid time off\nProfessional development opportunities\nPotential for growth to full-time position",
    "salary": "$25 - $30 per hour, based on experience",
    "applyUrl": null,
    "active": true,
    "featured": false,
    "createdAt": "2025-03-13T03:34:40.386Z",
    "updatedAt": null
  },
  {
    "id": 1,
    "title": "Senior Project Manager",
    "department": "Project Management",
    "location": "Chicago, IL",
    "type": "full-time",
    "description": "We are seeking an experienced Project Manager to oversee large-scale commercial construction projects from inception to completion. The ideal candidate will have a proven track record of delivering projects on time and within budget while maintaining high quality standards.",
    "requirements": "Bachelor's degree in Construction Management, Civil Engineering, or related field\n7+ years of experience in construction project management\nPMP certification or equivalent\nProficient in project management software and MS Office Suite\nStrong understanding of construction methods, building codes, and industry standards\nExcellent communication, leadership, and problem-solving skills\nExperience with commercial construction projects valued at $10M+",
    "responsibilities": "Oversee all aspects of construction projects from pre-construction to closeout\nDevelop and maintain project schedules, budgets, and resource allocation plans\nCoordinate with architects, engineers, subcontractors, and regulatory agencies\nConduct regular site visits to monitor progress and ensure quality control\nManage project documentation, including contracts, change orders, and permits\nIdentify and mitigate project risks and resolve issues promptly\nLead client meetings and provide regular progress updates\nMentor junior project team members",
    "benefits": "Competitive salary and performance bonuses\nComprehensive health, dental, and vision insurance\n401(k) retirement plan with company match\nPaid time off and holidays\nProfessional development opportunities\nCompany vehicle or allowance",
    "salary": "$90,000 - $120,000 per year, based on experience",
    "applyUrl": null,
    "active": true,
    "featured": true,
    "createdAt": "2025-03-13T03:34:40.386Z",
    "updatedAt": null
  }
]